import string

def convert(text):
  """
  يحول النص من الإنجليزية إلى العربية باستخدام لوحة المفاتيح العربية

  Args:
    text: النص المراد تحويله

  Returns:
    النص المحول
  """

  # إنشاء قاموس بالتحويلات

  keyboard = {
        "q": "ء",
        "w": "آ",
        "e": "أ",
        "r": "ب",
        "t": "ت",
        "y": "ث",
        "u": "ج",
        "i": "ح",
        "o": "خ",
        "p": "د",
        "a": "ذ",
        "s": "ر",
        "d": "ز",
        "f": "س",
        "g": "ش",
        "h": "ص",
        "j": "ض",
        "k": "ط",
        "l": "ظ",
        "z": "ع",
        "x": "غ",
        "c": "ف",
        "v": "ق",
        "b": "ك",
        "n": "ل",
        "m": "م",
        ".": ".",
        ",": ",",
        "?": "؟",
        ":": ":",
        "'": "'",
        '"': '"',
        "-": "-",
        "/": "/",
        "\\": "\\",
        "~": "~",
        "!": "!",
        "@": "@",
        "#": "#",
        "$": "$",
        "%": "%",
        "^": "^",
        "&": "&",
        "*": "*",
        "+": "+",
        "=": "=",
        "[": "[",
        "]": "]",
        "(": "(",
        ")": ")",
        "_": "_",
        "`": "`",
        "|": "|",
        "{": "{",
        "}": "}",
        ";": ";",
        "'": "'",
        " ": " ",
    }

  # تحويل النص

  new_text = ''
  for char in text:
    if char in keyboard:
      new_text += keyboard[char]
    else:
      new_text += char

  return new_text


if __name__ == '__main__':
  text = input('Enter Input : ')
  new_text = convert(text)
  print(new_text)
